app/controllers/parkings_controller.rb

SELECT "parkings".* FROM "parkings" WHERE (distrito LIKE '%Miraflores%') ORDER BY created_at DESC
SELECT "parkings".* FROM "parkings" WHERE "parkings"."id" IS NULL
---
  def index
    @parkings = Parking.all
      if params[:search]
        @parkings=Parking.search(params[:search]).order("created_at DESC")
      else
      if logged_in?
        @parkings = Parking.where(id: session[:id])