app/controllers/registros_controller.rb

  def index
    @registros = Registro.all
---
SELECT "registros".* FROM "registros"

  def create
    @registro = Registro.new(registro_params)

    respond_to do |format|
      if @registro.save
---
INSERT INTO "registros" ("correo", "documento", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["correo", ""], ["documento", ""], ["created_at", "2018-11-09 10:05:44.149944"], ["updated_at", "2018-11-09 10:05:44.149944"]]

  def destroy
    @registro.destroy
---
DELETE FROM "registros" WHERE "registros"."id" = ?  [["id", 1]]

    def set_registro
      @registro = Registro.find(params[:id])
---
SELECT  "registros".* FROM "registros" WHERE "registros"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]