app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."correo" = ? AND "users"."password" = ? LIMIT ?  [["correo", ""], ["password", ""], ["LIMIT", 1]]
---
  def create
    user = User.find_by(correo: params[:session][:correo].downcase, password: params[:session][:password])