app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    if logged_in?
    @users = User.all

INSERT INTO "users" ("numero_documento", "password", "created_at", "updated_at", "correo") VALUES (?, ?, ?, ?, ?)  [["numero_documento", ""], ["password", ""], ["created_at", "2018-11-22 08:28:01.632234"], ["updated_at", "2018-11-22 08:28:01.632234"], ["correo", ""]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save